In [1]:
import pandas as pd
import numpy as np

In [8]:
df = pd.read_csv('tips.csv')
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [5]:
def last_four(num):
    return str(num)[-4:]

In [6]:
df['CC Number'].apply(last_four)

0      3410
1      9230
2      1322
3      5994
4      7221
       ...
239    2842
240    5404
241    7196
242    0950
243    8139
Name: CC Number, Length: 244, dtype: object

In [20]:
def size_checker(size):
    if size == 1:
        return 'small'
    elif size == 2:
        return 'medium'
    else:
        return 'big'

In [25]:
df['yoyo'] = df['size'].apply(size_checker)

In [26]:
df['merged'] = df['Payer Name'] + '===' + df['sex']

In [28]:
lambda num: num*3

In [29]:
df['yoyo'] = df['size'].apply(lambda size: size*0)

In [42]:
def merger_func(col1, col2, delimiter):
    return str(col1) + delimiter + str(col2)

In [52]:
df['merge_func'] =df[['sex', 'Payer Name']].apply(lambda df: merger_func(df['sex'],df['Payer Name'], '|||'),axis=1)

In [53]:
df['merge_func'] = np.vectorize(merger_func)('yoy', 'hi', 'X')

In [54]:
df['merge_func']

0      yoyXhi
1      yoyXhi
2      yoyXhi
3      yoyXhi
4      yoyXhi
        ...
239    yoyXhi
240    yoyXhi
241    yoyXhi
242    yoyXhi
243    yoyXhi
Name: merge_func, Length: 244, dtype: object

In [56]:
df = pd.read_csv('tips.csv')

In [64]:
df.sort_values(['tip','size'],ascending=False)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025
...,...,...,...,...,...,...,...,...,...,...,...
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455
111,7.25,1.00,Female,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801

In [65]:
df['total_bill'].min()

3.07

In [69]:
df['total_bill'].idxmin()

67

In [72]:
df.iloc[67]

total_bill                      3.07
tip                              1.0
sex                           Female
smoker                           Yes
day                              Sat
time                          Dinner
size                               1
price_per_person                3.07
Payer Name             Tiffany Brock
CC Number           4359488526995267
Payment ID                   Sat3455
Name: 67, dtype: object

In [73]:
df['sex'].value_countsounts()

Male      157
Female     87
Name: sex, dtype: int64

In [75]:
df['day'].unique()

4

In [77]:
df['sex'].replace('Female', 'F')

0         F
1      Male
2      Male
3      Male
4         F
       ...
239    Male
240       F
241    Male
242    Male
243       F
Name: sex, Length: 244, dtype: object

In [78]:
df['sex'].replace(['Female','Male'], ['F', 'M'])

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [79]:
my_map = {'Female': 'FF', 'Male': 'MM'}

In [80]:
df['sex'].map(my_map)

0      FF
1      MM
2      MM
3      MM
4      FF
       ..
239    MM
240    FF
241    MM
242    MM
243    FF
Name: sex, Length: 244, dtype: object